-- 既存のワークアウトセッションテーブルがある場合に削除
DROP TABLE IF EXISTS workout_sessions;

-- ワークアウトセッションテーブルの作成
CREATE TABLE IF NOT EXISTS workout_sessions (
  id SERIAL PRIMARY KEY,
  session_title VARCHAR(50) NOT NULL,
  user_id INTEGER REFERENCES users(id) ON DELETE CASCADE,
  date DATE NOT NULL
);

-- ワークアウトセッションデータの挿入
INSERT INTO workout_sessions(session_title, user_id, "date") VALUES 
    ('胸の日', 1, DATE '2023-04-01'),
    ('胸の日', 1, DATE '2024-05-02'),
    ('胸の日', 1, DATE '2024-06-03'),
    ('胸の日', 2, DATE '2024-04-01'),
    ('胸の日', 2, DATE '2024-05-02'),
    ('胸の日', 3, DATE '2023-02-01'),
    ('胸の日', 3, DATE '2024-05-02'),
    ('胸の日', 1, DATE '2024-06-04'),
    ('胸の日', 1, DATE '2024-06-05'),
    ('胸の日', 1, DATE '2024-06-06'),
    ('胸の日', 1, DATE '2024-06-07'),
    ('胸の日', 1, DATE '2024-06-11'),
    ('胸の日', 1, DATE '2024-06-12'),
    ('胸の日', 1, DATE '2024-06-20'),
    ('胸の日', 1, DATE '2024-06-23'),
    ('胸の日', 1, DATE '2024-06-24'),
    ('胸の日', 1, DATE '2024-05-16'),
    ('胸の日', 1, DATE '2024-05-16'),
    ('胸の日', 1, DATE '2024-05-02'),
    ('胸の日', 1, DATE '2024-05-22'),
    ('胸の日', 1, DATE '2024-06-28'),
    ('胸の日', 3, DATE '2024-06-04'),
    ('胸の日', 3, DATE '2024-06-05'),
    ('胸の日', 3, DATE '2024-06-06'),
    ('胸の日', 3, DATE '2024-06-07'),
    ('胸の日', 3, DATE '2024-06-11'),
    ('胸の日', 3, DATE '2024-06-12'),
    ('胸の日', 3, DATE '2024-06-20'),
    ('胸の日', 3, DATE '2024-06-23'),
    ('胸の日', 3, DATE '2024-06-24'),
    ('胸の日', 3, DATE '2024-05-16'),
    ('胸の日', 3, DATE '2024-05-16'),
    ('胸の日', 3, DATE '2024-05-02'),
    ('胸の日', 3, DATE '2024-05-22'),
    ('脚と胸の日', 3, DATE '2024-06-24'),
    ('脚の日', 3, DATE '2024-06-30'),
    ('胸の日', 3, DATE '2024-07-02');
